---
kind: type
id: T:Autodesk.Revit.DB.Construction
source: html/b43d097e-b798-2aea-1008-ac79f71d3fc4.htm
---
# Autodesk.Revit.DB.Construction

Construction definition for Project Information.

## Syntax (C#)
```csharp
public class Construction
```

## Remarks
This is used to define the information in Constructions.xml.